In [1]:
#importing numpy and pandas
import numpy as np
import pandas as pd

In [2]:
#reading excel file and assigning into dataframe
filepath = r'C:\Users\Kyaw Ko Latt\Desktop\HMA Folder\HMA Google Data Analytics\Python\Python Projects\coffee-shop-sales-revenue-excel.xlsx'
df = pd.read_excel(filepath, sheet_name='coffee-shop-sales-revenue(copy)')

Initial screening of the data and preliminary statistics

In [3]:
df.head()

,transaction_id,transaction_date,transaction_time,transaction_qty,store_id,store_location,product_id,unit_price,product_category,product_type,product_detail
0,1,2023-01-01,07:06:11,2,5,Lower Manhattan,32,3.0,Coffee,Gourmet brewed coffee,Ethiopia Rg
1,2,2023-01-01,07:08:56,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg
2,3,2023-01-01,07:14:04,2,5,Lower Manhattan,59,4.5,Drinking Chocolate,Hot chocolate,Dark chocolate Lg
3,4,2023-01-01,07:20:24,1,5,Lower Manhattan,22,2.0,Coffee,Drip coffee,Our Old Time Diner Blend Sm
4,5,2023-01-01,07:22:41,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149116 entries, 0 to 149115
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   transaction_id    149116 non-null  int64
 1   transaction_date  149116 non-null  datetime64[ns]
 2   transaction_time  149116 non-null  object
 3   transaction_qty   149116 non-null  int64
 4   store_id          149116 non-null  int64
 5   store_location    149116 non-null  object
 6   product_id        149116 non-null  int64
 7   unit_price        149116 non-null  float64
 8   product_category  149116 non-null  object
 9   product_type      149116 non-null  object
 10  product_detail    149116 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(4), object(5)
memory usage: 12.5+ MB

In [5]:
df.describe()

,transaction_id,transaction_date,transaction_qty,store_id,product_id,unit_price
count,149116.000000,149116,149116.000000,149116.000000,149116.000000,149116.000000
mean,74737.371872,2023-04-15 11:50:32.173609984,1.438276,5.342063,47.918607,3.382219
min,1.000000,2023-01-01 00:00:00,1.000000,3.000000,1.000000,0.800000
25%,37335.750000,2023-03-06 00:00:00,1.000000,3.000000,33.000000,2.500000
50%,74727.500000,2023-04-24 00:00:00,1.000000,5.000000,47.000000,3.000000
75%,112094.250000,2023-05-30 00:00:00,2.000000,8.000000,60.000000,3.750000
max,149456.000000,2023-06-30 00:00:00,8.000000,8.000000,87.000000,45.000000
std,43153.600016,NaN,0.542509,2.074241,17.930020,2.658723

In [6]:
# A new Dataframe without date and time data for aggregation
filtered_df = df.drop(columns = ['transaction_time','transaction_date'])

# calculating total amount from transaction quantity and unit price
new_df = filtered_df.assign(total_amount = filtered_df['transaction_qty'] * filtered_df['unit_price'])

#total sales by store location
new_df.groupby(['store_location']).sum()['total_amount']

store_location
Astoria            232243.91
Hell's Kitchen     236511.17
Lower Manhattan    230057.25
Name: total_amount, dtype: float64

In [14]:
new_df.describe()

,transaction_id,transaction_qty,store_id,product_id,unit_price,total_amount
count,149116.000000,149116.000000,149116.000000,149116.000000,149116.000000,149116.000000
mean,74737.371872,1.438276,5.342063,47.918607,3.382219,4.686367
std,43153.600016,0.542509,2.074241,17.930020,2.658723,4.227099
min,1.000000,1.000000,3.000000,1.000000,0.800000,0.800000
25%,37335.750000,1.000000,3.000000,33.000000,2.500000,3.000000
50%,74727.500000,1.000000,5.000000,47.000000,3.000000,3.750000
75%,112094.250000,2.000000,8.000000,60.000000,3.750000,6.000000
max,149456.000000,8.000000,8.000000,87.000000,45.000000,360.000000

Average basket size is 1.4

Average transaction amount is 4.68$

In [12]:
new_df.groupby(['product_category']).sum(['']).sort_values(by=['total_amount'], ascending = False)
#total_amount by product category

,transaction_id,transaction_qty,store_id,product_id,unit_price,total_amount
product_category,,,,,,
Coffee,4374016464,89250,312591,1962332,176629.30,269952.45
Tea,3382312693,69737,240556,2251235,128035.35,196405.95
Bakery,1701309874,23214,122253,1681771,80964.14,82315.64
Drinking Chocolate,852609712,17457,60029,682740,47578.75,72416.00
Coffee beans,131060427,1828,9921,9466,36845.25,40085.25
Branded,57115939,776,3534,61337,13237.00,13607.00
Loose Tea,91491092,1210,6817,17474,11213.60,11213.60
Flavours,518179438,10511,38080,469306,5432.00,8408.80
Packaged Chocolate,36442305,487,2806,9770,4407.64,4407.64


Coffee, Tea, Bakery are the 3 best selling product category